#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "Rus");

	int n,x;
	char* cf[5] = { "зелёной","красной","жёлтой","белой","чёрной" };
	char* cm[5] = { "зелёного","красного","жёлтого","белого","чёрного" };
	char* b[12] = { "крысы","коровы","тигра","зайца","дракона","змеи",
		"лошади","овцы","обезьяны","курицы","собаки","свиньи" };
	
	printf("enter the year: ");
	scanf_s("%i", &x);

	printf("год ");

	if (x > 1984)
	{
		n = x - 1984;
		if (n % 12 > 1 && n % 12 < 5)
		{
			printf("%s %s", cm[n / 12 % 5], b[n % 12]);
		}
		else
		{
			printf("%s %s", cf[n / 12 % 5], b[n % 12]);
		}
	}
	else
	{
		n = 1984 - x;
		if (12-(n % 12) > 1 && 12-(n % 12) < 5)
		{
			printf("%s %s", cm[4-((12 - (n % 12)) / 12) % 5], b[(12 - (n % 12)) % 12]);
		}
		else
		{
			printf("%s %s", cf[4-((12 - (n % 12)) / 12) % 5], b[(12 - (n % 12)) % 12]);
		}
	}

	return 0;
}