#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "Rus");

	int n;
	char* a[31] = { "десять","одиннадцать","двенадцать","тринадцать","четырнадцать",
		"пятнадцать","шестнадцать","семнадцать","восемнадцать",
		"девятнадцать","двадцать","двадцать одно","двадцать два",
		"двадцать три","двадцать четыре","двадцать пять",
		"двадцать шесть","двадцать семь","двадцать восемь",
		"двадцать девять","тридцать", "тридцать одно", "тридцать два",
		"тридцать три", "тридцать четыре", "тридцать пять ", "тридцать шесть",
		"тридцать семь", "тридцать восемь", "тридцать девять", "сорок" };

	printf("enter the numeral: ");
	scanf_s("%i", &n);
	
	printf("%s", a[n - 10]);

	if (n > 20 && n % 10 < 5 && n%10!=0)
	{
		printf(" учебное задание");
	}
	else
	{
		printf(" учебных заданий");
	}

	return 0;
}