#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "Rus");

	int d, m;
	char* a[31] = { "первое","второе","третье","четвёртое","пятое",
		"шестое","седьмое","восьмое","девятое","десятое",
		"одиннадцатое","двенадцатое","тринадцатое","четырнадцатое",
		"пятнадцатое","шестнадцатое","семнадцатое","восемнадцатое",
		"девятнадцатое","двадцатое","двадцать первое","двадцать второе",
		"двадцать третье","двадцать четвертое","двадцать пятое",
		"двадцать шестое","двадцать седьмое","двадцать восьмое",
		"двадцать девятое","тридцатое", "тридцать первое" };
	char* b[12] = { "января","февраля","марта","апреля","мая","июня",
		"июля","августа","сентября","октября","ноября","декабря" };

	printf("enter the day and the month: ");
	scanf_s("%i %i", &d, &m);

	printf("%s %s", a[d-1], b[m-1]);

	return 0;
}